#coding=utf-8
# 输入中文你好
print("你好")
# 编写程序输入你的名字 并输出
#请写出 多行文字 并对其进行注释

"""
asdfasdfasdfas
asdfasdfasdf
"""

#一条语句如果很长，如何来实现多行语句


#字符串操作
str = 'Runoob'
# 输出第一个到倒数第二个的所有字符
 # 输出字符串第一个字符

 # 输出从第三个开始到第五个的字符
 # 输出从第三个开始的后的所有字符
# 输出字符串两次
# 连接字符串


#做一个不换行输出


#如何查询变量所指的对象类型

#演示删除一个对象的引用


#演示 数值运算 除法，得到一个浮点数
#演示 数值运算 除法，得到一个整数

#演示 数值运算 2的3次方

#演示 数值运算 取余
#判断题 回答python是否有 字符类型？



#演示声明一个列表

    #输出完整列表
    #输出第一个元素
    # # 从第二个开始输出到第三个元素
    # 输出从第三个元素开始的所有元素
    # 再声明一个列表并连接

#列表的元素是可以修改的

#    第一个元素改成9




#元组和列表不同在与元素不能修改
# tuple=(12,"成",99.8,30)
#  输出第二个

#创建一个空的集合


#创建一个学生集合
students=["zhangsan","xo","llllls"]
# 判断 zhangsan 是否则在学生集合里面 如果是 输出yes
if "zhangsan" in students :
    print("true")
else:
    print("false")





a=set("abcl")
b=set("abcdef")
# print(a-b)
# print(a | b)
# print(a^b)

print(a-b)# a 和 b 的差集
print(a|b)# a 和 b 的并集

# a 和 b 中不同时存在的元素









